app/services/ScheduleService.php

    public function getSchedule()
    {
        return $this->schedule->table('lichhoc')
        ->select('subject.name as subject_name, teacher.name as teacher_name, class.nameClass,lichhoc.id as id_lichhoc,lichhoc.buoi,lichhoc.date,lichhoc.timeStar,lichhoc.timeEnd')
        ->join('subject', 'lichhoc.id_subject = subject.id')
        ->join('teacher', 'lichhoc.id_teacher = teacher.id')
        ->join('class', 'lichhoc.id_class = class.id')
        ->get()
        ->getResultArray();
---
SELECT `subject`.`name` as `subject_name`, `teacher`.`name` as `teacher_name`, `class`.`nameClass`, `lichhoc`.`id` as `id_lichhoc`, `lichhoc`.`buoi`, `lichhoc`.`date`, `lichhoc`.`timeStar`, `lichhoc`.`timeEnd`
FROM `lichhoc`
JOIN `subject` ON `lichhoc`.`id_subject` = `subject`.`id`
JOIN `teacher` ON `lichhoc`.`id_teacher` = `teacher`.`id`
JOIN `class` ON `lichhoc`.`id_class` = `class`.`id`

    public function getStudentsbyLichHoc($id_lichhoc){
        return $this->schedule->table('lichhoc')
        ->select('student.name as studentName,lichhoc.buoi,lichhoc.date, student.id as id_student, lichhoc.id as id_lichhoc ')
        ->join('student_class', 'lichhoc.id_class = student_class.class_id')->where('lichhoc.id', $id_lichhoc)
        ->join('student', 'student_class.student_id = student.id')
        ->get()
        ->getResultArray();
---
SELECT `student`.`name` as `studentName`, `lichhoc`.`buoi`, `lichhoc`.`date`, `student`.`id` as `id_student`, `lichhoc`.`id` as `id_lichhoc`
FROM `lichhoc`
JOIN `student_class` ON `lichhoc`.`id_class` = `student_class`.`class_id`
JOIN `student` ON `student_class`.`student_id` = `student`.`id`
WHERE `lichhoc`.`id` = '2'